do 
 local function run(msg,macthes) 
  local reply_id = msg ['id'] 
  if is_sudo(msg) and macthes[1] == 'امر1' then 
   local text = [[ 
   ߌهــْـِْـْْـِلاّ و ســهلا في احدا قوائم الاوامر ߌـــــــــــــــــــــــــــــــــ
   ߛاوامر حمايه المجموعه 
   رفع ادمن == لرفع ادمن في المجموعه
   تنزيل ادمن == لتنزيل ادمن في المجموعه
   الادمنيه == لعرض الادمنيه داخل المجموعه
   ــــــــــــــــــــــــــــــــــــ
   ☠ اوامر تخص الادمنيه ⚙
   حظر == لحظر وطرد عضو من المجموعه
   الغاء الحظر == لالغاء الحظر عن عضو 
   منع == لمنع كلمه داخل المجموعه 
   ߔϠالغاء منع == لالغاء منع كلمه داخل المجموعه 
   ــــــــــــــــــــــــــــــــــــــ 
   ߔقفل الوسائط == لقفل جميع الوسائط 
   فتح الوسائط == لفتح جميع الوسائط 
   ــــــــــــــــــــــــــــــــــــ
   ꙅ كتم  == لكتم عضو بواسطة الرد 
   ❓ ايدي  == لعرض ايدي المجموعه 
   ❓ ايدي بالرد == لعرض ايدي العضو 
    ـــــــــــــــــــــــــــــــــ
    ❇Ҩɧa: - @DEV_PRO
    ]]
   reply_msg(reply_id, text, ok_cb, false) 
  end 
  
  local reply_id = msg['id'] 
  if not is_momod(msg) then 
   local ghost = "لا تصــير مطي انت مــطور شي لعد انجب ߘటع" 
   reply_msg(reply_id, ghost, ok_cb, false) 
  end 
  
 end 
 return { 
  patterns ={ 
   "^(امر1)$", 
   }, 
  run = run 
  } 
 end 
