 do 

local function run(msg,macthes) 
local reply_id = msg ['id'] 
if is_sudo(msg) and macthes[1] == 'برو3' then 
local text = [[ 
🌹 اهَــْـِْـْْـِلاّ و ســهلا في احدا قوائم الاوامر 🌹 
♦🔹♦🔸♦🔹♦🔸♦🔹♦ 
❗️ أوامر الحماية في المجموعة 

  🔶 قفل الروابط == لقفل الروابط      
🔶 قفل اعاده توجيه == لقفل التوجيه    
 🔶 قفل الملصقات == لقفل الملصقات    
🔶 قفل الصور المتحركه == لقفل المتحركه 
 🔶قفل الفيديو == لقفل الفيديو        
🔶 قفل الصوت == لقفل الصوت       
🔶قفل الكلايش == لقفل الكلايش       
🔶 قفل التكرار == لقفل التكرار       
🔶 قفل البوتات == لقفل البوتات.      
🔶 قفل العربيه == لقفل العربيه       
 🔶قفل جهات الاتصال == لقفل الجهات    
 🔶قفل الجماعيه == لقفل الجماعيه       
  🔶قفل الاصافه == لقفل الاصافه        
🔶 قفل الدردشه == لقفل الدردشه      
 🔶قفل الوسائط == لقفل الوسائط       
🔶 قفل المجموعه == لقفل المجموعه    
♦🔹♦🔸♦🔹♦🔸♦ 
 🔷 فتح الروابط == لفتح الروابط     
🔷 فتح اعاده توجيه == لفتح التوجيه   
🔷 فتح الملصقات == لفتح الملصقات   
🔷 فتح الصور المتحركه == لفتح المتحركه
🔷 فتح الفيديو == لفتح الفيديو     
🔷 فتح الصوت == لفتح الصوت     
🔷 فتح الكلايش == لفتح الكلايش    
🔷 فتح التكرار == لفتح التكرار     
🔷 فتح البوتات == لفتح البوتات     
🔷 فتح العربيه == لفتح العربيه     
🔷 فتح جهات الاتصال == لفتح الجهات 
  🔷فتح الجماعيه == لفتح الجماعيه     
🔷 فتح الاضافه == لفتح الاضافه     
 🔷فتح الدردشه == لفتح الدردشه     
 🔷فتح الوسائط == لفتح الوسائط      
 🔷فتح المجموعه == لفتح المجموعه    

♦🔸♦🔹♦🔸♦🔹♦🔸♦🔹♦ 
⚠ DEVS    == TAEM DEV PRO 
⚠ channel == @DEV_PRO 
]] 
reply_msg(reply_id, text, ok_cb, false) 
end 

local reply_id = msg['id'] 
if not is_momod(msg) then 
local ghost = "لا تصــير مطي انت ادمــن شي لعد انجب 😠😹" 
reply_msg(reply_id, ghost, ok_cb, false) 
end 

end 
return { 
patterns ={ 
  "^(برو3)$", 
}, 
run = run 
} 
end 
