 do 

local function run(msg,macthes) 
local reply_id = msg ['id'] 
if is_sudo(msg) and macthes[1] == 'امر2' then 
local text = [[ 
🌹 اهَــْـِْـْْـِلاّ و ســهلا في احدا قوائم الاوامر 🌹 
ــــــــــــــــــــــــــــــــــــ 
💡 أوامر المجموعة العامة. 
🔷ضع صورة == لوضع وصف 
🔷ضع قوانين == لوضع قوانين 
🔷ضع معرف == لوضع معرف 
🔷ضع وصف == لوضع وصف 
🔷ضع اسم == لوضع اسم 
🔷ضع معرف == لوضع معرف 
🔷ضع رابط == لوضع رابط 
🔷الرابط == لعرض رابط 
🔷الرابط خاص == الرابط خاص 
🔷القوانين == لعرض  القوانين 
🔷الوصف == لعرض  الوصف 
ــــــــــــــــــــــــــــــــــــ 
🔶المطور == لعرض معلومات المطور 
🔶معلوماتي == لعرض المعلومات 
🔶ايدي == لعرض ايدي المجموعه 
🔶ايدي بالرد == لعرض ايدي الشخص 
🔶الاعدادات == لعرض اعدادات المجموعة 
🔶قائمه المحظورين == لعرض قائمه المحظورين 
🔶قائمه العام == لعرض قائمه المحظورين عام 
🔶اعدادات الوسائط == لعرض اعدادات الميديا 
🔶معلومات المجموعة == لعرض معلومات المجموعة 
ــــــــــــــــــــــــــــــــــــــ 
❇Ҩɧα:- @DEV_PRO 
]] 
reply_msg(reply_id, text, ok_cb, false) 
end 

local reply_id = msg['id'] 
if not is_momod(msg) then 
local ghost = "لا تصــير مطي انت ادمــن شي لعد انجب 😠😹" 
reply_msg(reply_id, ghost, ok_cb, false) 
end 

end 
return { 
patterns ={ 
  "^(امر2)$", 
}, 
run = run 
} 
end 
